app/Controllers/Productos_Controllers.php

SELECT *
FROM `productos`
ORDER BY `id` ASC
---
    public function mostrarProductos (){

        $productos = new Productos_model();
        $galeria = new Galeria_model();

        $data2 ['galeria'] = $galeria -> orderBy ('id','ASC')-> findAll();
        $datos['productos'] = $productos -> orderBy ('id', 'ASC') ->findAll();